namespace AssigmentOOP4
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //answer 1
            #region part 1 answer 1,2 
            //q1
            // a=q1 يعني انا بظهر للمستخدم الوظائف والمعلومات الاساسيه وبخفى عنه تفاصيل التنفيذ
            //b=q2 اكتر 3 بيسهل علينا الصيانه بقلل التعقيد يعني انا بخفى عن المستخدم الحاجه الى مش بتفيده 2كمان بتخلي الكود redable 

            //q2 
            // abstract class: ده كلاس عنده فيلد وميثود وبيحصل فيه وراثه وكمان عنده كونستراكتور مينفعش نعمل منه اوبجيكت مباشر بالnew
            //interfas هو مجرد عقد بين اكتر من كلاس عمره م يحتوي على  فيلد ولا عنده كونستراكتور ولا بيورث  من كلاس ممكن يورث من انترفيس 
            //q2 لما اكون عايزه اعمل contract الكلاس عايزاهم ينفذوها  لما مكونش محتاجه انه يورث من الاب حاجه
            //q3 الكلاس ميقدرش يورث اكتر من abstract class ال لكن الكلاس يقدر يورث من  اكتر interface

            #endregion

        }
    }
}
